Revit 2027 API
ParameterTypeId.SteelElemAnchorOrientation Property
 "Anchor Orientation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SteelElemAnchorOrientation { get; }
Public Shared ReadOnly Property SteelElemAnchorOrientation As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SteelElemAnchorOrientation {
	ForgeTypeId^ get ();
}
static member SteelElemAnchorOrientation : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace